In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')

In [3]:
print(df)

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [5]:
print(df[['Name','Salary']])

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [6]:
df['Salary'].min()

50000

In [7]:
df['Salary'].mean()

83333.33333333333

In [8]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [9]:
df[df['Age']>30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [10]:
df['Age']>30

0     True
1     True
2    False
Name: Age, dtype: bool